Revit 2027 API
RebarTrimExtendData.AddBarGeometry(CurveLoop) Method
 Adds a new rebar geometry. This information is set to the rebar after the API execution is finished successfully.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public RebarFreeFormValidationResult AddBarGeometry(
	CurveLoop curves
)
Public Function AddBarGeometry (
	curves As CurveLoop
) As RebarFreeFormValidationResult
public:
RebarFreeFormValidationResult AddBarGeometry(
	CurveLoop^ curves
)
member AddBarGeometry :
        curves : CurveLoop -> RebarFreeFormValidationResult
Parameters
curves CurveLoop
 Curves describing one bar in the set.
Return Value
RebarFreeFormValidationResult
 Returns Success if everything is ok, otherwise the failure reason.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
InvalidOperationException |  Incorrect number of bar geometry.
Remarks
This function can fail due to following reasons:
CurveLoop is empty.
CurveLoop contains an unbounded curve.
A rebar constructed from curves can't be bent according to the bending radius.
See Also
Reference
RebarTrimExtendData Class
AddBarGeometry Overload
Autodesk.Revit.DB.Structure Namespace